// tslint:disable:quotemark
export const currencyResources: any = {
  "AED": {
    "c": "د.إ.‏"
  },
  "AFN": {
    "c": "؋"
  },
  "ALL": {
    "c": "Lek"
  },
  "AMD": {
    "c": "դր."
  },
  "ARS": {
    "c": "$"
  },
  "AUD": {
    "c": "$"
  },
  "AZN": {
    "c": "₼"
  },
  "BAM": {
    "c": "КМ"
  },
  "BDT": {
    "c": "৳"
  },
  "BGN": {
    "c": "лв."
  },
  "BHD": {
    "b": 3,
    "c": "د.ب.‏"
  },
  "BND": {
    "b": 0,
    "c": "$"
  },
  "BOB": {
    "c": "$b"
  },
  "BRL": {
    "c": "R$"
  },
  "BYR": {
    "c": "р."
  },
  "BZD": {
    "c": "BZ$"
  },
  "CAD": {
    "c": "$"
  },
  "CHF": {
    "c": "Fr."
  },
  "CLP": {
    "c": "$"
  },
  "CNY": {
    "c": "¥"
  },
  "COP": {
    "c": "$"
  },
  "CRC": {
    "c": "₡"
  },
  "CSD": {
    "c": "Din."
  },
  "CZK": {
    "c": "Kč"
  },
  "DKK": {
    "c": "kr."
  },
  "DOP": {
    "c": "RD$"
  },
  "DZD": {
    "c": "DA"
  },
  "EEK": {
    "c": "kr"
  },
  "EGP": {
    "c": "ج.م.‏"
  },
  "ETB": {
    "c": "ETB"
  },
  "EUR": {
    "c": "€"
  },
  "GBP": {
    "c": "£"
  },
  "GEL": {
    "c": "Lari"
  },
  "GTQ": {
    "c": "Q"
  },
  "HKD": {
    "c": "HK$"
  },
  "HNL": {
    "c": "L."
  },
  "HRK": {
    "c": "kn"
  },
  "HUF": {
    "c": "Ft"
  },
  "IDR": {
    "b": 0,
    "c": "Rp"
  },
  "ILS": {
    "c": "₪"
  },
  "INR": {
    "c": "Rs."
  },
  "ISK": {
    "b": 0,
    "c": "kr."
  },
  "JMD": {
    "c": "J$"
  },
  "JOD": {
    "b": 3,
    "c": "د.ا.‏"
  },
  "JPY": {
    "b": 0,
    "c": "¥"
  },
  "KES": {
    "c": "S"
  },
  "KGS": {
    "c": "сом"
  },
  "KHR": {
    "c": "៛"
  },
  "KRW": {
    "b": 0,
    "c": "₩"
  },
  "KWD": {
    "b": 3,
    "c": "د.ك.‏"
  },
  "KZT": {
    "c": "Т"
  },
  "LAK": {
    "c": "₭"
  },
  "LBP": {
    "c": "ل.ل.‏"
  },
  "LKR": {
    "c": "රු."
  },
  "LTL": {
    "c": "Lt"
  },
  "LVL": {
    "c": "Ls"
  },
  "LYD": {
    "b": 3,
    "c": "د.ل.‏"
  },
  "MAD": {
    "c": "د.م.‏"
  },
  "MKD": {
    "c": "ден."
  },
  "MNT": {
    "c": "₮"
  },
  "MOP": {
    "c": "MOP"
  },
  "MVR": {
    "c": "ރ."
  },
  "MXN": {
    "c": "$"
  },
  "MYR": {
    "c": "RM"
  },
  "NIO": {
    "c": "C$"
  },
  "NOK": {
    "c": "kr"
  },
  "NPR": {
    "c": "रु"
  },
  "NZD": {
    "c": "$"
  },
  "OMR": {
    "b": 3,
    "c": "ر.ع.‏"
  },
  "PAB": {
    "c": "B/."
  },
  "PEN": {
    "c": "S/."
  },
  "PHP": {
    "c": "Php"
  },
  "PKR": {
    "c": "Rs"
  },
  "PLN": {
    "c": "zł"
  },
  "PYG": {
    "c": "Gs"
  },
  "QAR": {
    "c": "ر.ق.‏"
  },
  "RON": {
    "c": "lei"
  },
  "RSD": {
    "c": "Din."
  },
  "RUB": {
    "c": "₽"
  },
  "RWF": {
    "c": "RWF"
  },
  "SAR": {
    "c": "ر.س.‏"
  },
  "SEK": {
    "c": "kr"
  },
  "SGD": {
    "c": "$"
  },
  "SYP": {
    "c": "ل.س.‏"
  },
  "THB": {
    "c": "฿"
  },
  "TJS": {
    "c": "т.р."
  },
  "TMT": {
    "c": "m."
  },
  "TND": {
    "b": 3,
    "c": "د.ت.‏"
  },
  "TRY": {
    "c": "TL"
  },
  "TTD": {
    "c": "TT$"
  },
  "TWD": {
    "c": "NT$"
  },
  "UAH": {
    "c": "₴"
  },
  "USD": {
    "c": "$"
  },
  "UYU": {
    "c": "$U"
  },
  "UZS": {
    "c": "so'm"
  },
  "VEF": {
    "c": "Bs. F."
  },
  "VND": {
    "b": 0,
    "c": "₫"
  },
  "XOF": {
    "c": "XOF"
  },
  "YER": {
    "c": "ر.ي.‏"
  },
  "ZAR": {
    "c": "R"
  },
  "ZWL": {
    "c": "Z$"
  }
};
